<?php

/**
 * Implements hook_strongarm().
 */
function elms_cle_strongarm() {
  $export = array();

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'theme_default';
  $strongarm->value = 'cube';
  $export['theme_default'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'filter_html_1';
  $strongarm->value = '1';
  $export['filter_html_1'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'book_allowed_types';
  $strongarm->value = array(
    0 => 'folder',
    1 => 'link',
    2 => 'page',
    3 => 'poll',
    4 => 'referenced_page',
  );
  $export['book_allowed_types'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'book_child_type';
  $strongarm->value = 'page';
  $export['book_child_type'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;

  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'site_404';
  $strongarm->value = 'customerror/404';
  $export['site_404'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'space_type';
  $strongarm->value = 'og';
  $export['space_type'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'spaces_features';
  $strongarm->value = array(
    'spaces_dashboard' => '0',
  );
  $export['spaces_features'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'spaces_preset_og';
  $strongarm->value = 'og_private';
  $export['spaces_preset_og'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'spaces_preset_status';
  $strongarm->value = array(
    'og_controlled' => '1',
  );
  $export['spaces_preset_status'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'table';
  $strongarm->value = array(
    0 => array(
      'weight' => '0',
    ),
    1 => array(
      'weight' => '0',
    ),
  );
  $export['table'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'teaser_length';
  $strongarm->value = '200';
  $export['teaser_length'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'theme_chamfer_settings';
  $strongarm->value = array(
    'chamfer_borders' => 1,
    'chamfer_bgimage' => 0,
    'chamfer_top_logo' => 1,
    'chamfer_top_link' => '',
    'chamfer_bottom_logo' => 1,
    'chamfer_bottom_link' => '',
    'chamfer_color_template' => 'default',
    'chamfer_color_primary' => '000000',
    'chamfer_color_secondary' => '000000',
    'chamfer_color_header1' => '0099FF',
    'chamfer_color_header2' => '00CCFF',
    'chamfer_color_text' => '666666',
    'chamfer_color_link' => '0099FF',
    'chamfer_color_blocks' => 'E7E7E7',
    'chamfer_color_blockstyle_link' => '6D6D6D',
    'chamfer_color_blockstyle_bgcolor' => 'df5c5c',
    'chamfer_color_blockstyle_linkhover' => 'FFFFFF',
    'chamfer_color_footer_text' => 'FFFFFF',
    'chamfer_color_footer_link' => '00CCFF',
    'mission' => '',
    'default_logo' => 1,
    'logo_path' => '',
    'default_favicon' => 1,
    'favicon_path' => '',
    'primary_links' => 1,
    'secondary_links' => 1,
    'toggle_logo' => 1,
    'toggle_favicon' => 1,
    'toggle_name' => 1,
    'toggle_search' => 0,
    'toggle_slogan' => 1,
    'toggle_mission' => 0,
    'toggle_node_user_picture' => 0,
    'toggle_comment_user_picture' => 0,
    'toggle_primary_links' => 0,
    'toggle_secondary_links' => 0,
    'toggle_node_info_accessibility_guideline' => 0,
    'toggle_node_info_accessibility_test' => 0,
    'toggle_node_info_parent' => 0,
    'toggle_node_info_studio_submission' => 1,
    'toggle_node_info_site' => 0,
    'toggle_node_info_content_links' => 0,
    'toggle_node_info_elms_resource' => 0,
    'toggle_node_info_folder' => 0,
    'toggle_node_info_link' => 0,
    'toggle_node_info_page' => 0,
    'toggle_node_info_place' => 0,
    'toggle_node_info_poll' => 0,
    'toggle_node_info_reaction' => 0,
    'toggle_node_info_referenced_page' => 0,
    'toggle_node_info_term' => 0,
    'toggle_node_info_timeline_item' => 0,
    'logo_upload' => '',
    'favicon_upload' => '',
  );
  $export['theme_chamfer_settings'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'theme_settings';
  $strongarm->value = array(
    'toggle_logo' => 1,
    'toggle_name' => 1,
    'toggle_slogan' => 1,
    'toggle_mission' => 0,
    'toggle_node_user_picture' => 0,
    'toggle_comment_user_picture' => 0,
    'toggle_search' => 0,
    'toggle_favicon' => 1,
    'toggle_primary_links' => 0,
    'toggle_secondary_links' => 0,
    'toggle_node_info_accessibility_guideline' => 0,
    'toggle_node_info_accessibility_test' => 0,
    'toggle_node_info_content_links' => 0,
    'toggle_node_info_parent' => 0,
    'toggle_node_info_elms_resource' => 0,
    'toggle_node_info_folder' => 0,
    'toggle_node_info_link' => 0,
    'toggle_node_info_page' => 0,
    'toggle_node_info_place' => 0,
    'toggle_node_info_poll' => 0,
    'toggle_node_info_reaction' => 0,
    'toggle_node_info_referenced_page' => 0,
    'toggle_node_info_term' => 0,
    'toggle_node_info_timeline_item' => 0,
    'toggle_node_info_site' => 0,
    'default_logo' => 1,
    'logo_path' => '',
    'logo_upload' => '',
    'default_favicon' => 1,
    'favicon_path' => '',
    'favicon_upload' => '',
  );
  $export['theme_settings'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'tipsy';
  $strongarm->value = array(
    'drupal_forms' => array(
      'forms' => 0,
      'options' => array(
        'fade' => 1,
        'gravity' => 'autoWE',
        'delayIn' => '0',
        'delayOut' => '0',
        'trigger' => 'focus',
        'opacity' => '0.8',
        'offset' => '0',
      ),
    ),
    'custom_selectors' => array(
      0 => array(
        'selector' => '#regions_elms_navigation_left a, #regions_elms_navigation_left .regions_pre_block_container',
        'options' => array(
          'fade' => 0,
          'gravity' => 'w',
          'trigger' => 'hover',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      1 => array(
        'selector' => '#regions_block_elms_navigation_top_1 a',
        'options' => array(
          'fade' => 0,
          'gravity' => 'ne',
          'trigger' => 'hover',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '1',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      2 => array(
        'selector' => '#regions_block_elms_navigation_top_2 li a',
        'options' => array(
          'fade' => 0,
          'gravity' => 'e',
          'trigger' => 'hover',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      3 => array(
        'selector' => '#regions_block_elms_navigation_bottom_0 a,',
        'options' => array(
          'fade' => 0,
          'gravity' => 'se',
          'trigger' => 'hover',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      4 => array(
        'selector' => '#regions_block_elms_navigation_top_0 a',
        'options' => array(
          'fade' => 0,
          'gravity' => 'nw',
          'trigger' => 'hover',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      5 => array(
        'selector' => '#regions_elms_navigation_left a, #regions_elms_navigation_left .regions_pre_block_container',
        'options' => array(
          'fade' => 0,
          'gravity' => 'w',
          'trigger' => 'focus',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      6 => array(
        'selector' => '#regions_block_elms_navigation_bottom_0 a,',
        'options' => array(
          'fade' => 0,
          'gravity' => 'se',
          'trigger' => 'focus',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      7 => array(
        'selector' => '#regions_block_elms_navigation_top_1 a',
        'options' => array(
          'fade' => 0,
          'gravity' => 'ne',
          'trigger' => 'focus',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      8 => array(
        'selector' => '#regions_block_elms_navigation_top_0 a',
        'options' => array(
          'fade' => 0,
          'gravity' => 'nw',
          'trigger' => 'focus',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      9 => array(
        'selector' => '#regions_block_elms_navigation_top_2 li a',
        'options' => array(
          'fade' => 0,
          'gravity' => 'e',
          'trigger' => 'focus',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      10 => array(
        'selector' => '#regions_block_elms_navigation_top_2 .regions_block_title a',
        'options' => array(
          'fade' => 0,
          'gravity' => 'ne',
          'trigger' => 'hover',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      11 => array(
        'selector' => '#regions_block_elms_navigation_top_2 .regions_block_title a',
        'options' => array(
          'fade' => 0,
          'gravity' => 'ne',
          'trigger' => 'focus',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      12 => array(
        'selector' => '.advanced-help-link',
        'options' => array(
          'fade' => 0,
          'gravity' => 's',
          'trigger' => 'hover',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      13 => array(
        'selector' => '.advanced-help-link',
        'options' => array(
          'fade' => 0,
          'gravity' => 's',
          'trigger' => 'focus',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      14 => array(
        'selector' => '#nrhi_container a',
        'options' => array(
          'fade' => 0,
          'gravity' => 'autoNS',
          'trigger' => 'hover',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
      15 => array(
        'selector' => '#nrhi_container a',
        'options' => array(
          'fade' => 0,
          'gravity' => 'autoNS',
          'trigger' => 'focus',
          'delayIn' => '0',
          'delayOut' => '0',
          'opacity' => '1',
          'offset' => '0',
          'html' => 0,
          'title' => 'title',
        ),
      ),
    ),
  );
  $export['tipsy'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'unique_field_comp_parent';
  $strongarm->value = 'each';
  $export['unique_field_comp_parent'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'unique_field_fields_parent';
  $strongarm->value = array(
    0 => 'title',
  );
  $export['unique_field_fields_parent'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'unique_field_scope_parent';
  $strongarm->value = 'type';
  $export['unique_field_scope_parent'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'unique_field_show_matches_parent';
  $strongarm->value = array(
    0 => 'show_matches',
  );
  $export['unique_field_show_matches_parent'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'update_check_frequency';
  $strongarm->value = '7';
  $export['update_check_frequency'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'update_notification_threshold';
  $strongarm->value = 'security';
  $export['update_notification_threshold'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'upload_accessibility_guideline';
  $strongarm->value = '1';
  $export['upload_accessibility_guideline'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'upload_accessibility_test';
  $strongarm->value = '1';
  $export['upload_accessibility_test'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'user_picture_default';
  $strongarm->value = 'profiles/elms/images/default-avatar.gif';
  $export['user_picture_default'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'user_picture_dimensions';
  $strongarm->value = '85x85';
  $export['user_picture_dimensions'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'user_picture_file_size';
  $strongarm->value = '30';
  $export['user_picture_file_size'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'user_picture_guidelines';
  $strongarm->value = '';
  $export['user_picture_guidelines'] = $strongarm;

  $strongarm = new stdClass;
  $strongarm->disabled = FALSE; /* Edit this to true to make a default strongarm disabled initially */
  $strongarm->api_version = 1;
  $strongarm->name = 'user_picture_path';
